docs/posts/2017-02-23-give-me-words-of-grace.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 23, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Give Me Words of Grace</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Give Me Words of Grace</h1>
<p class="subtitle" role="doc-subtitle">Feb 23, 2017</p>
</header><p>
Thinking a lot about the power of language this week. Here&rsquo;s my prayer for the week:
</p>

<p>
In arrogant blindness,<br>
I fail to see that<br>
what does not offend me<br>
may still be offensive<br>
to those around me.
</p>

<p>
Our words are keys,<br>
with the power to<br>
both lock and unlock.<br>
They can open doors<br>
to future conversations<br>
or close them forever.<br>
They can be vehicles of grace<br>
or weapons of hate and destruction.
</p>

<p>
Help me choose grace.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 23, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
